source/blog/2014-10-22-tmp.org
#+TITLE: tmp
#+DATE: 2014-10-22
#+SETUPFILE: ~/sys/lib/org-sty/octopress.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 
#+JEKYLL_PUBLISHED: true
#+OPTIONS: toc:nil

* HI
* 1
** 2
*** 3
**** 4
***** 5
****** 6
* table
| a | b | c |
|---+---+---|
| 4 | 5 | 6 |
| 1 | 2 | 3 |

* Lord of the Rings
   My favorite scenes are (in this order)
   1. The attack of the Rohirrim
   2. Eowyn's fight with the witch king
      + this was already my favorite scene in the book
      + I really like Miranda Otto.
   3. Peter Jackson being shot by Legolas
      - on DVD only
      He makes a really funny face when it happens.
      But in the end, no individual scenes matter but the film as a whole.
   Important actors in this film are:
   - Elijah Wood :: He plays Frodo
   - Sean Austin :: He plays Sam, Frodo's friend.  I still remember
     him very well from his role as Mikey Walsh in The Goonies.

* Tmp
+ A
  + ABT
  + TA
    + ABNAT
      - aobnta
      + AOBTNEBN
+ B
+ C
- d
- e
+ F
- g
+ 1
  + 2
    + 3
      - 4
        - 5
          - 6
            - 7
              - 8
                - 9
* TABLE [[http://orgmode.org/manual/Tables-in-HTML-export.html#Tables-in-HTML-export][table]]
#+CAPTION: This is a table with lines around and between cells
#+ATTR_HTML: :border 2 :rules all :frame border
|      a | bbbbbbbbbb | c | d                      | e |
|--------+------------+---+------------------------+---|
| 111111 |            |   |                        |   |
|      2 |            |   |                        |   |
|      3 |            |   | jjjjjjjjjjjjjjjjjjjjjj |   |
|      4 |            |   |                        |   |


* TEXT [[http://orgmode.org/manual/Text-areas-in-HTML-export.html#Text-areas-in-HTML-export][text]]
#+ATTR_HTML: :textarea t :width 40
#+BEGIN_EXAMPLE
  (defun org-xor (a b)
     "Exclusive or."
     (if a (not b) b))
#+END_EXAMPLE


{{{more}}}
