source/_posts/2014-10-22-tmp.html
---
title: "tmp"
date: 2014-10-22
layout: post
categories: 
published: true
comments: 
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> HI</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 1</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 2</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 3</h4>
<div class="outline-text-4" id="text-2-1-1">
</div><ol class="org-ol"><li><a id="sec-2-1-1-1" name="sec-2-1-1-1"></a>4<br  /><ol class="org-ol"><li><a id="sec-2-1-1-1-1" name="sec-2-1-1-1-1"></a>5<br  /><ol class="org-ol"><li><a id="sec-2-1-1-1-1-1" name="sec-2-1-1-1-1-1"></a>6<br  /></li></ol>
</li></ol>
</li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> table</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">a</th>
<th scope="col" class="right">b</th>
<th scope="col" class="right">c</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">4</td>
<td class="right">5</td>
<td class="right">6</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">2</td>
<td class="right">3</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lord of the Rings</h2>
<div class="outline-text-2" id="text-4">
<p>
My favorite scenes are (in this order)
</p>
<ol class="org-ol">
<li>The attack of the Rohirrim
</li>
<li>Eowyn's fight with the witch king
<ul class="org-ul">
<li>this was already my favorite scene in the book
</li>
<li>I really like Miranda Otto.
</li>
</ul>
</li>
<li>Peter Jackson being shot by Legolas
<ul class="org-ul">
<li>on DVD only
</li>
</ul>
<p>
He makes a really funny face when it happens.
But in the end, no individual scenes matter but the film as a whole.
</p>
</li>
</ol>
<p>
Important actors in this film are:
</p>
<dl class="org-dl">
<dt> Elijah Wood </dt><dd>He plays Frodo
</dd>
<dt> Sean Austin </dt><dd>He plays Sam, Frodo's friend.  I still remember
him very well from his role as Mikey Walsh in The Goonies.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Tmp</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>A
<ul class="org-ul">
<li>ABT
</li>
<li>TA
<ul class="org-ul">
<li>ABNAT
<ul class="org-ul">
<li>aobnta
</li>
<li>AOBTNEBN
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>B
</li>
<li>C
</li>
<li>d
</li>
<li>e
</li>
<li>F
</li>
<li>g
</li>
<li>1
<ul class="org-ul">
<li>2
<ul class="org-ul">
<li>3
<ul class="org-ul">
<li>4
<ul class="org-ul">
<li>5
<ul class="org-ul">
<li>6
<ul class="org-ul">
<li>7
<ul class="org-ul">
<li>8
<ul class="org-ul">
<li>9
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> TABLE <a href="http://orgmode.org/manual/Tables-in-HTML-export.html#Tables-in-HTML-export">table</a></h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">
<caption class="t-above"><span class="table-number">Table 1:</span> This is a table with lines around and between cells</caption>

<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">a</th>
<th scope="col" class="left">bbbbbbbbbb</th>
<th scope="col" class="left">c</th>
<th scope="col" class="left">d</th>
<th scope="col" class="left">e</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">111111</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">jjjjjjjjjjjjjjjjjjjjjj</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> TEXT <a href="http://orgmode.org/manual/Text-areas-in-HTML-export.html#Text-areas-in-HTML-export">text</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<textarea cols="40" rows="3">
(defun org-xor (a b)
   "Exclusive or."
   (if a (not b) b))
</textarea>
</p>


<p>

</p>
</div>
</div>
